# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

# level_setting とりあえず10年✖️365日✖️24時間
[
    ['2', '2'],['3', '4'],['4','8'],['5','16'],['6','32'],['7','64'],['8','128'],['9','256'],['10','512'],['11','1024'],['12','2028'],['13','4056'],['14','8112'],['15','16224'],['16','32448'],['17','64896'],['18','129792']
].each do |level, thresold|
    LevelSetting.create!(
        { level: level, thresold: thresold}
    )
end


# テストユーザー1
User.create!(
    last_name: "支援",
    first_name: "勉強",
    kana_first_name: "シエン",
    kana_last_name: "ベンキョウ",
    email: "guest@mail.com",
    password: "password",
    password_confirmation: "password",
)

[
    ['2', '2'],['3', '4'],['4','8'],['5','16'],['6','32'],['7','64'],['8','128'],['9','256'],['10','512'],['11','1024'],['12','2028'],['13','4056'],['14','8112'],['15','16224'],['16','32448'],['17','64896'],['18','129792']
].each do |level, thresold|
TextBook.create!(
    { user_id: 1, day: thresold, time: , genre: , comment: , created_at: ,}
    )

# ランダムユーザー
last_names =  ["佐藤", "鈴木", "高橋", "田中", "伊藤", "山本", "渡辺", "中村", "小林", "加藤", "吉田", "山田", "佐々木", "山口", "松本", "井上", "木村", "林", "斎藤", "清水", "山崎", "阿部", "森", "池田", "橋本", "山下", "石川", "中島", "前田", "藤田", "後藤", "小川", "岡田", "村上", "長谷川", "近藤", "石井", "斉藤", "坂本", "遠藤", "藤井", "青木", "福田", "三浦", "西村", "藤原", "太田", "松田", "原田", "岡本", "中野", "中川", "小野", "田村", "竹内", "金子", "中山", "和田", "石田", "工藤", "上田", "原", "森田", "酒井", "横山", "柴田", "宮崎", "宮本", "内田", "高木", "谷口", "安藤", "丸山", "今井", "大野", "高田", "菅原", "河野", "武田", "藤本", "上野", "杉山", "千葉", "村田", "増田", "小島", "小山", "大塚", "平野", "久保", "渡部", "松井", "菊地", "岩崎", "松尾", "佐野", "木下", "野口", "野村", "新井", "田口", "盛合"]
first_names =  ["翔太", "蓮", "翔", "陸", "颯太", "悠斗", "大翔", "翼", "樹", "奏太", "大和", "大輝", "悠", "隼人", "健太", "大輔", "駿", "陽斗", "優", "陽", "悠人", "誠", "拓海", "仁", "悠太", "悠真", "大地", "健", "遼", "大樹", "諒", "響", "太一", "一郎", "優斗", "亮", "海斗", "颯", "亮太", "匠", "陽太", "航", "瑛太", "直樹", "空", "光", "太郎", "輝", "一輝", "蒼", "葵", "優那", "優奈", "凛", "陽菜", "愛", "結衣", "美咲", "楓", "さくら", "遥", "美優", "莉子", "七海", "美月", "結菜", "真央", "花音", "陽子", "舞", "美羽", "優衣", "未来", "彩", "彩乃", "彩花", "優", "智子", "奈々", "千尋", "愛美", "優菜", "杏", "裕子", "芽衣", "綾乃", "琴音", "桜", "恵", "杏奈", "美桜", "優花", "玲奈", "結", "茜", "美穂", "明日香", "愛子", "美緒", "碧", "悠介", "年章", "一刀"]
kana_last_names =  ["サトウ", "スズキ", "タカハシ", "タナカ", "イトウ", "ヤマモト", "ワタナベ", "ナカムラ", "コバヤシ", "カトウ", "ヨシダ", "ヤマダ", "ササキ", "ヤマグチ", "マツモト", "イノウエ", "キムラ", "ハヤシ", "サイトウ", "シミズ", "ヤマザキ", "アベ", "モリ", "イケダ", "ハシモト", "ヤマシタ", "イシカワ", "ナカジマ", "マエダ", "フジタ", "ゴトウ", "オガワ", "オカダ", "ムラカミ", "ハセガワ", "コンドウ", "イシイ", "サイトウ", "サカモト", "エンドウ", "フジイ", "アオキ", "フクダ", "ミウラ", "ニシムラ", "フジワラ", "オオタ", "マツダ", "ハラダ", "オカモト", "ナカノ", "ナカガワ", "オノ", "タムラ", "タケウチ", "カネコ", "ナカヤマ", "ワダ", "イシダ", "クドウ", "ウエダ", "ハラ", "モリタ", "サカイ", "ヨコヤマ", "シバタ", "ミヤザキ", "ミヤモト", "ウチダ", "タカギ", "タニグチ", "アンドウ", "マルヤマ", "イマイ", "オオノ", "タカダ", "スガワラ", "コウノ", "タケダ", "フジモト", "ウエノ", "スギヤマ", "チバ", "ムラタ", "マスダ", "コジマ", "コヤマ", "オオツカ", "ヒラノ", "クボ", "ワタナベ", "マツイ", "キクチ", "イワサキ", "マツオ", "サノ", "キノシタ", "ノグチ", "ノムラ", "アライ", "タグチ", "モリアイ"]
kana_first_names =  ["ショウタ", "レン", "ショウ", "リク", "ソウタ", "ユウト", "ヒロト", "ツバサ", "イツキ", "ソウタ", "ヤマト", "ダイキ", "ユウ", "ハヤト", "ケンタ", "ダイスケ", "シュン", "ハルト", "ユウ", "ヨウ", "ユウト", "マコト", "タクミ", "ジン", "ユウタ", "ユウマ", "ダイチ", "タケル", "リョウ", "ダイキ", "リョウ", "ヒビキ", "タイチ", "イチロウ", "ユウト", "リョウ", "カイト", "カエデ", "リョウタ", "タクミ", "ヨウタ", "ワタル", "エイタ", "ナオキ", "ソラ", "ヒカリ", "タロウ", "アキラ", "カズキ", "アオイ", "アオイ", "ユウナ", "ユウナ", "リン", "ハルナ", "アイ", "ユイ", "ミサキ", "カエデ", "サクラ", "ハルカ", "ミユウ", "リコ", "ナナミ", "ミヅキ", "ユナ", "マオ", "カノン", "ヨウコ", "マイ", "ミウ", "ユイ", "ミク", "アヤ", "アヤノ", "アヤカ", "ユウ", "トモコ", "ナナ", "チヒロ", "マナミ", "ユウナ", "アン", "ユウコ", "メイ", "アヤノ", "コトネ", "サクラ", "メグミ", "アンナ", "ミウ", "ユウカ", "レナ", "ユイ", "アカネ", "ミホ", "アスカ", "アイコ", "ミオ", "ミドリ", "ユウスケ", "トシアキ", "カズワキ"]

# Faker日本語設定z 
Faker::Config.locale = :ja

30.times do |n|
    first_name_random = rand(first_names.length)
    last_name_random = rand(last_names.length)
    first_name = first_names[first_name_random]
    last_name = last_names[last_name_random]
    kana_first_name = kana_first_names[first_name_random]
    kana_last_name = kana_last_names[last_name_random]
    email = Faker::Internet.email(domain: 'example')

    user = User.create!(
        first_name: first_name,
        last_name: last_name,
        kana_first_name: kana_first_name,
        kana_last_name: kana_last_name,
        email: email,
        password: 'password',
        password_confirmation: 'password'
    )
end
