app/controllers/study_times_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "study_times".* FROM "study_times" WHERE "study_times"."user_id" = ?  [["user_id", 1]]
---
  def index
    @user = User.find(current_user.id)
    @study_times = StudyTime.where(user_id: current_user.id)

INSERT INTO "study_times" ("user_id", "day", "time", "genre", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["day", 0], ["time", 10], ["genre", "因数分解"], ["comment", "宿題"], ["created_at", "2020-05-29 09:46:17.174103"], ["updated_at", "2020-05-29 09:46:17.174103"]]
---
  def create
    @study_time = StudyTime.new(study_time_params)
    @study_time.user_id = current_user.id
    if @study_time.save

SELECT  "study_times".* FROM "study_times" WHERE "study_times"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @study_time = StudyTime.find(params[:id])

SELECT  "study_times".* FROM "study_times" WHERE "study_times"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @study_time = StudyTime.find(params[:id])

SELECT  "study_times".* FROM "study_times" WHERE "study_times"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "study_times" SET "comment" = ?, "updated_at" = ? WHERE "study_times"."id" = ?  [["comment", "自習"], ["updated_at", "2020-05-29 10:33:42.287453"], ["id", 1]]
---
  def update
    @study_time = StudyTime.find(params[:id])
    if @study_time.update(study_time_params)

SELECT  "study_times".* FROM "study_times" WHERE "study_times"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "study_times" WHERE "study_times"."id" = ?  [["id", 2]]
---
  def destroy
    @study_time = StudyTime.find(params[:id])
    @study_time.destroy