app/controllers/textbooks_controller.rb

  def index
    @textbooks = Textbook.where(user_id: current_user.id).page(params[:page]).per(5)
---
SELECT "textbooks".* FROM "textbooks" WHERE "textbooks"."user_id" = ?  [["user_id", 1]]

  def create
    @textbook = Textbook.new(textbook_params)
    @textbook.user_id = current_user.id
    if @textbook.save
---
INSERT INTO "textbooks" ("user_id", "title", "status", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "aa"], ["status", 2], ["note", "kkk"], ["created_at", "2020-05-27 12:51:09.703611"], ["updated_at", "2020-05-27 12:51:09.703611"]]

  def show
    @textbook = Textbook.find(params[:id])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @textbook = Textbook.find(params[:id])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @textbook = Textbook.find(params[:id])
    if @textbook.update(textbook_params)
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "textbooks" SET "title" = ?, "image_id" = ?, "updated_at" = ? WHERE "textbooks"."id" = ?  [["title", "aaa"], ["image_id", "cdd84c2c12326e0ded99d3fe77d95625299a7fc5c8aa8e7306341478c739"], ["updated_at", "2020-05-29 10:27:30.275664"], ["id", 15]]

  def destroy
    @textbook = Textbook.find(params[:id])
    @textbook.destroy
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "textbooks" WHERE "textbooks"."id" = ?  [["id", 1]]