app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "first_name" = ?, "kana_last_name" = ?, "kana_first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "氏"], ["first_name", "名"], ["kana_last_name", "シ"], ["kana_first_name", "メイ"], ["updated_at", "2020-05-28 14:51:02.442849"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)